Мюнцкабинент_30/src/Documents/Инвентаризация/Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвентаризация</name>
  <registerRecords>AccumulationRegister.ДвиженияМонет</registerRecords>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Монета</name>
      <type>
        <types>CatalogRef.Монеты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВКоллекции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчетноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦены</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленаЗапросом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мюнцкабинент_30/src/AccumulationRegisters/ДвиженияМонет/ДвиженияМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияМонет</name>
  <comment>Приходные и расходные операции с монетами</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <comment>Фактически себестоимость единицы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/InformationRegisters/НомерВКоллекции/НомерВКоллекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомерВКоллекции</name>
  <comment>Номера ячеек, в котоых хранится монеты</comment>
  <resources>
    <name>Номер</name>
    <comment>Номер ячейки в альбоме, в котором хранится монета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Монета</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/Documents/Инвентаризация/Forms/ФормаДокумента/Module.bsl
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КоллекцияПриИзменении(Элемент)
	
	КоллекцияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КоллекцияПриИзмененииНаСервере()
	
	Если Объект.Коллекция.КоличествоЯчеек <> 0 Тогда
		Элементы.СписокНомерВКоллекции.МаксимальноеЗначение = Объект.Коллекция.КоличествоЯчеек;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Коллекция", Объект.Коллекция);
	Запрос.УстановитьПараметр("НаДату", Объект.Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Коллекция,
		|	ВложенныйЗапрос.Монета,
		|	ВложенныйЗапрос.НомерВКоллекции КАК НомерВКоллекции,
		|	ВложенныйЗапрос.УчетноеКоличество,
		|	ВложенныйЗапрос.УчетноеКоличество КАК ФактическоеКоличество,
		|	ВложенныйЗапрос.Цена,
		|	ВложенныйЗапрос.Сумма,
		|	ИСТИНА КАК ДобавленаЗапросом
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДвиженияМонетОстатки.Коллекция КАК Коллекция,
		|		ДвиженияМонетОстатки.Объект КАК Монета,
		|		НомерВКоллекции.Номер КАК НомерВКоллекции,
		|		ДвиженияМонетОстатки.КоличествоОстаток КАК УчетноеКоличество,
		|		ДвиженияМонетОстатки.СтоимостьОстаток КАК Цена,
		|		ДвиженияМонетОстатки.СтоимостьОстаток * ДвиженияМонетОстатки.КоличествоОстаток КАК Сумма
		|	ИЗ
		|		РегистрНакопления.ДвиженияМонет.Остатки(&НаДату, Коллекция = &Коллекция) КАК ДвиженияМонетОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомерВКоллекции КАК НомерВКоллекции
		|			ПО ДвиженияМонетОстатки.Объект = НомерВКоллекции.Монета
		|	ГДЕ
		|		ДвиженияМонетОстатки.КоличествоОстаток <> 0) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерВКоллекции,
		|	ВложенныйЗапрос.Монета.ВидМонеты.ГодВыпуска,
		|	ВложенныйЗапрос.Монета.ВидМонеты.Номинал";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Список.Загрузить(РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	// убрал в условное оформление
	//Если (Элемент.ТекущиеДанные.ДобавленаЗапросом И Элемент.ТекущиеДанные.УчетноеКоличество = Элемент.ТекущиеДанные.ФактическоеКоличество) И (Элемент.ТекущийЭлемент <> Элементы.СписокФактическоеКоличество) Тогда
	//	Отказ = Истина
	//КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Элемент.ТекущиеДанные.ДобавленаЗапросом
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Копирование
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФактическоеКоличествоПриИзменении(Элемент)
	
	Если Элементы.Список.ТекущиеДанные.ДобавленаЗапросом И Элементы.Список.ТекущиеДанные.УчетноеКоличество < Элементы.Список.ТекущиеДанные.ФактическоеКоличество Тогда
		ИмяПоля = "Список [" + Строка (Элементы.Список.ТекущаяСтрока) + "]" + ".ФактическоеКоличество";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В этой строке фактическое количество не может превышать учетное количество!'"), , ИмяПоля, "Объект");
		Элементы.Список.ТекущиеДанные.ФактическоеКоличество = Элементы.Список.ТекущиеДанные.УчетноеКоличество;
	КонецЕсли;	
	
	Элементы.Список.ТекущиеДанные.Сумма = Элементы.Список.ТекущиеДанные.ФактическоеКоличество * Элементы.Список.ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуМонеты(Команда)
	
	ПараметрыОткрытия 		= Новый Структура ("Ключ", Элементы.Список.ТекущиеДанные.Монета);
	Форма 						= ПолучитьФорму("Справочник.Монеты.ФормаОбъекта", ПараметрыОткрытия);
	Форма.ТолькоПросмотр 		= Истина;
	Форма.Открыть ();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
